{
    "onset": {
        "LongName": "Trial onset time.",
        "Description": "Trial onset time in seconds, relative to first data point stored in this file. The first 4 screens shown were a countdown; screens showing 1... 2... 3... 4... These were each 2 seconds long, all occuring before the first trial listed here. This is why the first onset is not 0 seconds. Analyses linking this data with fMRI timeseries may want to account for this. Additionally, there were cueing periods before every 6 trials (rule sets; see trial_type; also see cueStartTime and cueEndTime columns.)"
    },
    "duration": {
        "LongName": "Duration of trial.",
        "Description": "Duration of the given trial in seconds."
    },
    "accuracy_binarized": {
        "LongName": "Performance accuracy.",
        "Description": "Performance accuracy for the given trial, binarized. Note that 0 indicates error, which is either incorrect or non-response. See NaNs in response_time column for non-responses.",
        "Levels": {
            "0": "Error trial. Either incorrect or non-response.",
            "1": "Correct trial."
        }
    },
    "cueEndTime": {
        "LongName": "End time of cue period.",
        "Description": "Every 6 trials there is a cue period that indicates a rule (see trial_type); given in seconds."
    },
    "cueStartTime": {
        "LongName": "Start time of cue period.",
        "Description": "Every 6 trials there is a cue period that indicates a rule (see trial_type); given in seconds."
    },
    "fixEndTime": {
        "LongName": "Fixation period, end time.",
        "Description": "Fixation period occurring at the end of each trial, given in seconds."
    },
    "fixStartTime": {
        "LongName": "Fixation period; start time.",
        "Description": "Fixation period occurring at the end of each trial, given in seconds."
    },
    "response_time": {
        "LongName": "Response time.",
        "Description": "Response time to the given trial in seconds, relative to trial onset. NaN indicates non-responses."
    },
    "runEndTime": {
        "LongName": "End time for the entire run.",
        "Description": "End time for the entire Emotional Faces task run; only given on last trial (in seconds; should map to total TRs)."
    },
    "stimLeft": {
        "LongName": "Stimulus shown on bottom left of triangle.",
        "Description": "Stimulus file for the bottom left of triangle of images."
    },
    "stimRight": {
        "LongName": "Stimulus shown on the bottom right of triangle.",
        "Description": "Stimulus file for the bottom right of the triangle of images."
    },
    "stimTop": {
        "LongName": "Stimulus shown on top middle of triangle.",
        "Description": "Stimulus file for the top middle of the triangle of images; this is the reference."
    },
    "tr_seconds": {
        "LongName": "Repetition time (TR).",
        "Description": "TR for this scan, which should be the same for every trial. Useful for mapping between fMRI data (given in TRs) and task event data in corresponding tsv (given in s)."
    },
    "trialEndTime": {
        "LongName": "End time of the trial.",
        "Description": "The end time of the given trial, given in seconds."
    },
    "trial_type": {
        "LongName": "Emotional Faces task condition.",
        "Description": "The reference or to-be-matched stimulus type; rule given every 6 trials; either a face or shape. Shown in the top, middle.",
        "Levels": {
            "face": "When the rule was to match the face of the top-middle, choose if the bottom-left or bottom-right face matches.",
            "shape": "When the rule was to match the shape of the top-middle, choose if the bottom-left or bottom-right shape matches."
        }
    }
}